src/InformationRegisters/ЖурналЗапускаСкриптов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗапускаСкриптов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПустойЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скрипт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_Скрипты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ЗД_ТипСкрипта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЗД_ТипСкрипта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>bat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>cmd</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>os</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ЗД_Модуль_oscript_Привелегированный/Ext/Module.bsl
//Параметры = новый Структура;
 //Интропретатор = Строка запуска скрипта
 Процедура ЗапуститьСкрипт(мСкриптСсылка,ИнфБаза,Параметры=Неопределено) Экспорт
	 
	 МассивОшибок = Новый Массив;
	 ТипСкрипта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мСкриптСсылка,"ТипСкрипта");
	 
	 Если ТипСкрипта = Перечисления.ЗД_ТипСкрипта.os Тогда
		 ЗапуститьOSСкрипт(мСкриптСсылка,ИнфБаза,МассивОшибок);	 
		 
	 ИначеЕсли ТипСкрипта = Перечисления.ЗД_ТипСкрипта.bat Тогда
		 ЗапуститьBATСкрипт(мСкриптСсылка,ИнфБаза,МассивОшибок);
		 
	 ИначеЕсли ТипСкрипта = Перечисления.ЗД_ТипСкрипта.cmd Тогда
		 
		 ЗапуститьCMDСкрипт(мСкриптСсылка,ИнфБаза,МассивОшибок);		 
		 
	 Иначе
		 МассивОшибок.Добавить("ошибка: алгоритм не определен"); 		 		 
	 КонецЕсли;
	 
	 РегистрацияВыводОшибок("ЗД_Модуль_oscript_Привелегированный.ЗапуститьСкрипт",ИнфБаза,мСкриптСсылка,МассивОшибок)
	 
 КонецПроцедуры      
 
 Процедура ЗапуститьOSСкрипт(мСкриптСсылка,ИнфБаза,Параметры)
	 
	 //Проверка настроек путей запуска
	 МассивОшибок = Новый Массив;
	 ИнтроптераторОСкрипт = Константы.ЗД_ПутьДо_oscript.Получить();
	 Если не ЗначениеЗаполнено(ИнтроптераторОСкрипт) Тогда		 
		 МассивОшибок.Добавить("В настройках системы не указан путь до oscript");
	 Иначе		 
		 СтруктураПеременных = Новый Структура("Ошибка");
		 
		 //Формирование текста скрипта
		 мТекстСкрипта = Справочники.ЗД_Скрипты.СформироватьСкрипт(мСкриптСсылка,СтруктураПеременных);  
		 
		 Если не ПустаяСтрока(СтруктураПеременных.Ошибка) Тогда
			 МассивОшибок.Добавить("Ошибки формирования скрипта:"+мСкриптСсылка+Символы.ПС+СтруктураПеременных.Ошибка);		 
		 КонецЕсли;
		 
	 КонецЕсли; 
	 
	 ИмяФайла = ВернутьФайлСкрипта(мСкриптСсылка,мТекстСкрипта,".os",МассивОшибок);	 
	 
	 //Запуск скрипта на выполнение
	 Если МассивОшибок.Количество()=0 Тогда
		 
		 МассивКоманд = Новый Массив;
		 МассивКоманд.Добавить(ИнтроптераторОСкрипт);
		 МассивКоманд.Добавить(ИмяФайла);  
		 Если ТипЗнч(Параметры)=Тип("Структура") Тогда
			 Для каждого ТекПараметр из Параметры Цикл 
				 МассивКоманд.Добавить(ТекПараметр.Значение);  		 
			 КонецЦикла;
		 КонецЕсли;
		 
		 СтрокаКоманды = СтрСоединить(МассивКоманд," "); 
		 
		 ЗапуститьПриложение(СтрокаКоманды);	
		 РегистрыСведений.ЖурналЗапускаСкриптов.СоздатьЗаписьЗапускаСкрипта(ИнфБаза,мСкриптСсылка,"Успешно: "+СтрокаКоманды);
	 Иначе
		 
		 РегистрацияВыводОшибок("ЗД_Модуль_oscript_Привелегированный.ЗапуститьOSСкрипт",ИнфБаза,мСкриптСсылка,МассивОшибок);		 
		 
		 
	 КонецЕсли;
	 
 КонецПроцедуры   
 
 Процедура ЗапуститьCMDСкрипт(мСкриптСсылка,ИнфБаза,МассивОшибок)
	 
	 СтруктураПеременных = Новый Структура("ИБ,Ошибка",ИнфБаза,"");
	 
	 Ковычка = Символ(34);
	 //Формирование текста скрипта
	 мТекстСкрипта = Справочники.ЗД_Скрипты.СформироватьСкрипт(мСкриптСсылка,СтруктураПеременных);  
	 
	 
	 Если не ПустаяСтрока(СтруктураПеременных.Ошибка) Тогда
		 МассивОшибок.Добавить("Ошибки формирования скрипта:"+мСкриптСсылка+Символы.ПС+СтруктураПеременных.Ошибка);		 
		 
	 Иначе		 
		 //ОбъектСистемы = новый COMОбъект("WScript.Shell");				 
		 КодВозврата = 0;
		 Попытка			 
			 ЗапуститьПриложение(мТекстСкрипта,,Истина,КодВозврата);
			 //КодВозврата = ОбъектСистемы.Run(мТекстСкрипта, 0, 1);	
			 //Процесс = ОбъектСистемы.Exec(мТекстСкрипта);
			 
			 Если КодВозврата <> 0 Тогда
			     МассивОшибок.Добавить("Ошибка (код возврата):"+ КодВозврата);
			 Иначе
				РегистрыСведений.ЖурналЗапускаСкриптов.СоздатьЗаписьЗапускаСкрипта(ИнфБаза,мСкриптСсылка,"Успешно: ЗапуститьПриложение");	 
			 КонецЕсли;				 
		 Исключение     
			МассивОшибок.добавить("Ошибка запуска скрипта: "+КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			 
		 КонецПопытки;                                      		 
	 КонецЕсли;
	 
	 
	 
 КонецПроцедуры

 Процедура ЗапуститьBATСкрипт(мСкриптСсылка,ИнфБаза,МассивОшибок)
	 
	 
	 
	 СтруктураПеременных = Новый Структура("ИБ,Ошибка",ИнфБаза,"");
	 
	 Ковычка = Символ(34);
	 //Формирование текста скрипта
	 мТекстСкрипта = Справочники.ЗД_Скрипты.СформироватьСкрипт(мСкриптСсылка,СтруктураПеременных);  
	 
	 
	 Если не ПустаяСтрока(СтруктураПеременных.Ошибка) Тогда
		 МассивОшибок.Добавить("Ошибки формирования скрипта:"+мСкриптСсылка+Символы.ПС+СтруктураПеременных.Ошибка);		 
		 
	 Иначе		 
		 //ОбъектСистемы = новый COMОбъект("WScript.Shell");				 
		 КодВозврата = 0;  
		 КомандаЗапуска = "call "+мТекстСкрипта;
		 
		 // Сохраняем команду запуска в файл исполняемого скрипта BAT.
		 // Это нужно для обхода различных ограничений работы процедуры "ЗапуститьПриложение",
		 // которая некоторые команды не может обрабатывать корректно
		 ФайлСкрипта = ПолучитьИмяВременногоФайла("bat");
		 ТекстовыйДокумент = Новый ТекстовыйДокумент;
		 ТекстовыйДокумент.УстановитьТекст(КомандаЗапуска);
		 ТекстовыйДокумент.Записать(ФайлСкрипта, "cp866");
		 
		 Попытка			 
			 
			 
			 ЗапуститьПриложение(ФайлСкрипта,,Истина,КодВозврата);
			 //КодВозврата = ОбъектСистемы.Run(мТекстСкрипта, 0, 1);	
			 //Процесс = ОбъектСистемы.Exec(мТекстСкрипта);
			 
			 Если КодВозврата <> 0 Тогда
				 МассивОшибок.Добавить("Ошибка (код возврата):"+ КодВозврата);
			 Иначе
				 РегистрыСведений.ЖурналЗапускаСкриптов.СоздатьЗаписьЗапускаСкрипта(ИнфБаза,мСкриптСсылка,"Успешно: ЗапуститьПриложение");	 
			 КонецЕсли;				 
		 Исключение     
			 МассивОшибок.добавить("Ошибка запуска скрипта: "+КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			 
		 КонецПопытки;                                      		 
	 КонецЕсли;
	 
	 
	 //// Формируем текст команды для запуска. Здесь может быть произвольный текст команды или даже целый скрипт.
	 //КомандаЗапуска = "ping infostart.ru > ""{ПутьКФайлуРезультата}""";
	 //КомандаЗапуска = СтрЗаменить(КомандаЗапуска, "{ПутьКФайлуРезультата}", ПутьКФайлуРезультата);
	 //

	 //
	 //// Запускаем сформированный BAT-скрипт на выполнение
	 //КодВозврата = Неопределено;
	 //ЗапуститьПриложение(ФайлСкрипта,, Истина, КодВозврата);
	 //
	 //Если КодВозврата = 0 Тогда
	 //    // Если ошибок при выполнении нет, то получаем строку вывода результата
	 //    ТекстовыйДокуменнт = Новый ТекстовыйДокумент;
	 //    ТекстовыйДокуменнт.Прочитать(ПутьКФайлуРезультата, "cp866");
	 //    ТекстРезультат = ТекстовыйДокуменнт.ПолучитьТекст();
	 //Иначе
	 //    // Иначе вызываем исключение
	 //    ВызватьИсключение "Ошибка выполнения команды. Код возврата: " + КодВозврата;
	 //КонецЕсли;
	 
	 //// Удаляем временные файлы
	 //УдалитьФайлЕслиВозможно(ФайлСкрипта);
	 //УдалитьФайлЕслиВозможно(ПутьКФайлуРезультата);	 
	 //
	 
 КонецПроцедуры
 
 
 
 Функция ВернутьФайлСкрипта(ИмяСкрипта,мТекстСкрипт,ТипФайла,МассивОшибок)
	 
	 СтрокаКоманды = КаталогВременныхФайлов()+СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяСкрипта)+ТипФайла;
	 ТелоКоманды = Новый ТекстовыйДокумент;
	 ТелоКоманды.УстановитьТекст(мТекстСкрипт);
	 ТелоКоманды.Записать(СтрокаКоманды,"UTF-8");			
	 
	 
	 //// открываем файл и считываем символы после символов BOM
	 //Данные = Новый ДвоичныеДанные(СтрокаКоманды);
	 //Строка64=Base64Строка(Данные);
	 //Строка64=Прав(Строка64,СтрДлина(Строка64)-4);
	 //ДанныеНаЗапись=Base64Значение(Строка64);
	 //ДанныеНаЗапись.Записать(СтрокаКоманды); // записываем	 
	 
	 НФ = новый Файл(СтрокаКоманды);
	 Если не НФ.Существует() Тогда
		 МассивОшибок.Добавить("Файл не существует:"+СтрокаКоманды);	 
	 КонецЕсли; 
	 
	 Возврат СтрокаКоманды;
	 
 КонецФункции
 
 Процедура РегистрацияВыводОшибок(ИмяСобытия,ИнфБаза,мСкриптСсылка,МассивОшибок) 
	 
	 Если МассивОшибок.Количество()>0 Тогда
		 мСообщениеОбОшибке = СтрСоединить(МассивОшибок," ");
		 
		 ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,,мСкриптСсылка,мСообщениеОбОшибке);
		 
		 РегистрыСведений.ЖурналЗапускаСкриптов.СоздатьЗаписьЗапускаСкрипта(ИнфБаза,мСкриптСсылка,"Ошибка: "+мСообщениеОбОшибке);
		 МассивОшибок =  Новый Массив;			 
	 КонецЕсли;	 
	 
	 
 КонецПроцедуры
